; domain
(define (domain pacman)

    (:requirements :strips :disjunctive-preconditions :typing :conditional-effects :negative-preconditions)

    (:types
        posicao
    )

    (:predicates
        ; Predicados de Localização
        (pacman-em ?px ?py - posicao)

        (fantasmaG-em ?px ?py - posicao)
        (fantasmaB-em ?px ?py - posicao)

        (frutaG-em ?px ?py - posicao)
        (frutaB-em ?px ?py - posicao)
        (parede-em ?px ?py - posicao)

        ; Predicados de liberação
        (pacman-liberado)

        (fantasmaG-liberado)
        (fantasmaB-liberado)

        ; Predicados de Direção do Fantasma Azul:
        (fantasmaB-up)
        (fantasmaB-right)
        (fantasmaB-down)
        (fantasmaB-left)

        ; Predicados de Direção do Fantasma Verde:
        (fantasmaG-up)
        (fantasmaG-right)
        (fantasmaG-down)
        (fantasmaG-left)

        ; Predicados de Checagem de Morte:
        (checar-morto-pre)
        (checar-morto-pos)

        ; Predicados de Incremento/Decremento:
        (inc ?x ?xn)
        (dec ?x ?xn)

        ; Predicados frutas:
        (frutaG-ativa)
        (frutaB-ativa)

        ; Predicados de finalização
        (fantasmaG-morto)
        (fantasmaB-morto)
        (pacman-morto)
    )
    ;-------------------------------------------Checagem---------------------------------------------------------
    (:action checagem-morto-pre
        :parameters (?px ?py - posicao)
        :precondition (and (checar-morto-pre) (pacman-em ?px ?py))
        :effect (and
            (when
                (or
                    (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py))
                    (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py))
                )
                (pacman-morto)
            )
            (not(checar-morto-pre))
            (fantasmaG-liberado)
            (when
                (and (pacman-em ?px ?py) (frutaG-em ?px ?py))
                (and (frutaG-ativa) (not(frutaB-ativa))))
            (when
                (and (pacman-em ?px ?py) (frutaB-em ?px ?py))
                (and (frutaB-ativa) (not(frutaG-ativa))))
        )
    )
    (:action checagem-morto-pos
        :parameters (?px ?py - posicao)
        :precondition (and (or (checar-morto-pos) (fantasmaB-morto)) (pacman-em ?px ?py))
        :effect (and
            (when
                (or
                    (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py))
                    (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py))
                )
                (pacman-morto)
            )
            (not(checar-morto-pos))
            (pacman-liberado)
        )
    )
    ;---------------------------------------------------Pacman------------------------------------------------------
    (:action move-pacman-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )
                (and
                    (not (pacman-em ?x ?y))
                    (not(pacman-liberado))
                    (pacman-em ?x ?yn)
                    (fantasmaG-up)
                    (fantasmaB-down)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not (pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?x ?yn)
                    (fantasmaB-up)
                    (fantasmaG-down)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?xn ?y)
                    (fantasmaB-right)
                    (fantasmaG-left)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?xn ?y)
                    (fantasmaB-left)
                    (fantasmaG-right)
                    (checar-morto-pre)
                )
            )
        )
    )

    ; ------------------------------------------------FantasmaGreen-----------------------------------------------------------

    (:action move-fantasmaG-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaG-em ?x ?y) (fantasmaG-liberado) (not(fantasmaG-morto)) (fantasmaG-up) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )
                (and
                    (not(fantasmaG-em ?x ?y))
                    (fantasmaG-em ?x ?yn)
                    (not(fantasmaG-up))
                    (not(fantasmaG-liberado))
                    (fantasmaB-liberado)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaG-liberado)) (not(fantasmaG-up)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaG-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaG-em ?x ?y) (fantasmaG-liberado) (not(fantasmaG-morto)) (fantasmaG-down) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )
                (and
                    (not(fantasmaG-em ?x ?y))
                    (fantasmaG-em ?x ?yn)
                    (not(fantasmaG-down))
                    (not(fantasmaG-liberado))
                    (fantasmaB-liberado)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaG-liberado)) (not(fantasmaG-down)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaG-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaG-em ?x ?y) (fantasmaG-liberado) (not(fantasmaG-morto)) (fantasmaG-left) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )
                (and
                    (not(fantasmaG-em ?x ?y))
                    (fantasmaG-em ?xn ?y)
                    (not(fantasmaG-left))
                    (not(fantasmaG-liberado))
                    (fantasmaB-liberado)

                )
            )

            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaG-liberado)) (not(fantasmaG-left)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaG-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaG-em ?x ?y) (fantasmaG-liberado) (not(fantasmaG-morto)) (fantasmaG-right) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )
                (and
                    (not(fantasmaG-em ?x ?y))
                    (fantasmaG-em ?xn ?y)
                    (not(fantasmaG-right))
                    (not(fantasmaG-liberado))
                    (fantasmaB-liberado)

                )
            )

            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaG-liberado)) (not(fantasmaG-right)) (checar-morto-pos))
            )
        )
    )
    ;---------------------------------------------FantasmaBlue-------------------------------------------------------------
    (:action move-fantasmaB-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (or (fantasmaB-liberado) (fantasmaG-morto)) (not(fantasmaB-morto)) (fantasmaB-up) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?x ?yn)

                    (not(fantasmaB-liberado))
                    (not(fantasmaB-up))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaB-liberado)) (not(fantasmaG-up)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (or (fantasmaB-liberado) (fantasmaG-morto)) (not(fantasmaB-morto)) (fantasmaB-down) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?x ?yn)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-down))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaB-liberado)) (not(fantasmaG-down)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (or (fantasmaB-liberado) (fantasmaG-morto)) (not(fantasmaB-morto)) (fantasmaB-left) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?xn ?y)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-left))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaB-liberado)) (not(fantasmaG-left)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (or (fantasmaB-liberado) (fantasmaG-morto)) (not(fantasmaB-morto)) (fantasmaB-right) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?xn ?y)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-right))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaB-liberado)) (not(fantasmaG-right)) (checar-morto-pos))
            )
        )
    )

    (:action comer-fantasma-Blue
        :parameters (?px ?py - posicao)
        :precondition (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py) (frutaB-ativa))
        :effect (and (fantasmaB-morto) (not(frutaB-ativa)) (not(fantasmaB-em ?px ?py)))
    )

    (:action comer-fantasma-Green
        :parameters (?px ?py - posicao)
        :precondition (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py) (frutaG-ativa))
        :effect (and (fantasmaG-morto) (not(frutaG-ativa)) (not(fantasmaG-em ?px ?py)))
    )
)

; problem
(define (problem pacman3x3)
    (:domain pacman)
    (:objects
        x1 x2 x3 x4 x5 y1 y2 y3 y4 y5 - posicao
    )
    (:init
        (pacman-liberado)
        (pacman-em x2 y2)

        (fantasmaG-em x4 y4)
        (frutaG-em x3 y3)

        (fantasmaB-em x3 y4)
        (frutaB-em x4 y2)

        (parede-em x1 y1)
        (parede-em x1 y2)
        (parede-em x1 y3)
        (parede-em x1 y4)
        (parede-em x1 y5)
        (parede-em x2 y1)
        (parede-em x2 y5)
        (parede-em x3 y1)
        (parede-em x3 y5)
        (parede-em x4 y1)
        (parede-em x4 y5)
        (parede-em x5 y1)
        (parede-em x5 y2)
        (parede-em x5 y3)
        (parede-em x5 y4)
        (parede-em x5 y5)

        (inc x1 x2)
        (inc x2 x3)
        (inc x3 x4)
        (inc x4 x5)
        (inc y1 y2)
        (inc y2 y3)
        (inc y3 y4)
        (inc y4 y5)
        (dec x5 x4)
        (dec x4 x3)
        (dec x3 x2)
        (dec x2 x1)
        (dec y5 y4)
        (dec y4 y3)
        (dec y3 y2)
        (dec y2 y1)

    )
    (:goal
        (and
            (not(pacman-morto))
            (fantasmaG-morto)
            (fantasmaB-morto)
        )
    )
)

; plan
1. (move-pacman-down x2 y2 y3)
   deleted: (pacman-em x2 y2) (pacman-liberado)
   added: (pacman-em x2 y3) (fantasmab-up) (fantasmag-down) (checar-morto-pre)
   goals met: 1 of 3
2. (checagem-morto-pre x2 y3)
   deleted: (checar-morto-pre)
   added: (fantasmag-liberado)
   goals met: 1 of 3
3. (move-fantasmag-down x4 y4 y5)
   deleted: (fantasmag-liberado) (fantasmag-down)
   added: (checar-morto-pos)
   goals met: 1 of 3
4. (checagem-morto-pos x2 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 3
5. (move-pacman-right x2 y3 x3)
   deleted: (pacman-em x2 y3) (pacman-liberado)
   added: (pacman-em x3 y3) (fantasmab-left) (fantasmag-right) (checar-morto-pre)
   goals met: 1 of 3
6. (checagem-morto-pre x3 y3)
   deleted: (checar-morto-pre)
   added: (fantasmag-liberado) (frutag-ativa)
   goals met: 1 of 3
7. (move-fantasmag-right x4 y4 x5)
   deleted: (fantasmag-liberado) (fantasmag-right)
   added: (checar-morto-pos)
   goals met: 1 of 3
8. (checagem-morto-pos x3 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 3
9. (move-pacman-right x3 y3 x4)
   deleted: (pacman-em x3 y3) (pacman-liberado)
   added: (pacman-em x4 y3) (fantasmag-right) (checar-morto-pre)
   goals met: 1 of 3
10. (checagem-morto-pre x4 y3)
   deleted: (checar-morto-pre)
   added: (fantasmag-liberado)
   goals met: 1 of 3
11. (move-fantasmag-right x4 y4 x5)
   deleted: (fantasmag-liberado) (fantasmag-right)
   added: (checar-morto-pos)
   goals met: 1 of 3
12. (checagem-morto-pos x4 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 3
13. (move-pacman-down x4 y3 y4)
   deleted: (pacman-em x4 y3) (pacman-liberado)
   added: (pacman-em x4 y4) (fantasmag-down) (checar-morto-pre)
   goals met: 1 of 3
14. (comer-fantasma-green x4 y4)
   deleted: (frutag-ativa) (fantasmag-em x4 y4)
   added: (fantasmag-morto)
   goals met: 2 of 3
15. (move-fantasmab-left x3 y4 x2)
   deleted: (fantasmab-em x3 y4) (fantasmab-left)
   added: (fantasmab-em x2 y4) (checar-morto-pos)
   goals met: 2 of 3
16. (checagem-morto-pos x4 y4)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 2 of 3
17. (move-pacman-up x4 y4 y3)
   deleted: (pacman-em x4 y4) (pacman-liberado)
   added: (pacman-em x4 y3) (fantasmag-up) (fantasmab-down)
   goals met: 2 of 3
18. (move-fantasmab-down x2 y4 y5)
   deleted: (fantasmag-down)
   added: (checar-morto-pos)
   goals met: 2 of 3
19. (checagem-morto-pos x4 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 2 of 3
20. (move-pacman-up x4 y3 y2)
   deleted: (pacman-em x4 y3) (pacman-liberado)
   added: (pacman-em x4 y2)
   goals met: 2 of 3
21. (checagem-morto-pre x4 y2)
   deleted: (checar-morto-pre)
   added: (fantasmag-liberado) (frutab-ativa)
   goals met: 2 of 3
22. (move-fantasmab-up x2 y4 y3)
   deleted: (fantasmab-em x2 y4) (fantasmab-up)
   added: (fantasmab-em x2 y3) (checar-morto-pos)
   goals met: 2 of 3
23. (checagem-morto-pos x4 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 2 of 3
24. (move-pacman-left x4 y2 x3)
   deleted: (pacman-em x4 y2) (pacman-liberado)
   added: (pacman-em x3 y2) (fantasmab-right) (fantasmag-left) (checar-morto-pre)
   goals met: 2 of 3
25. (move-fantasmab-right x2 y3 x3)
   deleted: (fantasmab-em x2 y3) (fantasmab-right)
   added: (fantasmab-em x3 y3) (checar-morto-pos)
   goals met: 2 of 3
26. (checagem-morto-pos x3 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 2 of 3
27. (move-pacman-down x3 y2 y3)
   deleted: (pacman-em x3 y2) (pacman-liberado)
   added: (pacman-em x3 y3) (fantasmab-up) (fantasmag-down)
   goals met: 2 of 3
28. (comer-fantasma-blue x3 y3)
   deleted: (frutab-ativa) (fantasmab-em x3 y3)
   added: (fantasmab-morto)
   goals met: 3 of 3
